app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @all_ratings = Movie.getRatings
    redirect = false

    #decide whether or not to use params or session for sort
    if params[:sort]
      @sort = params[:sort]
    elsif session[:sort]
      @sort = session[:sort]
      redirect = true
    end

    #decide whether or not to use params or session for ratings
    if params[:ratings]
      @ratings = params[:ratings]
    elsif session[:ratings]
      @ratings = session[:ratings]
      redirect = true
    else #default
      @ratings = Hash.new
      @all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R') ORDER BY #{session[:sort]} ASC

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "movies" SET "title" = 'Men in Black II', "updated_at" = '2013-11-20 20:55:18.724796' WHERE "movies"."id" = 12